Repository: pingfangx/TranslatorX-other
Catalog: JavaDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Returns a string identifying this pool, as well as its state, including indications of run state and estimated worker and task counts.
zh_cn: 返回一个字符串，标识该池，以及它的状态，包括运行状态的指示和估计工人和任务计数。

source: Returns a string map view of this process builder's environment.
zh_cn: 返回此进程生成器环境的字符串映射视图。

source: Returns a string representation of the double argument.
zh_cn: 返回 double 参数的字符串表示形式。

source: Returns a string representation of the float argument.
zh_cn: 返回 float 参数的字符串表示形式。

source: Returns a string representation of the long argument as an unsigned integer in base 16.
zh_cn: 以十六进制无符号整数形式返回 long 参数的字符串表示形式。

source: Returns a string representation of the long argument as an unsigned integer in base 2.
zh_cn: 以二进制无符号整数形式返回 long 参数的字符串表示形式。

source: Returns a string representation of the long argument as an unsigned integer in base 8.
zh_cn: 以八进制无符号整数形式返回 long 参数的字符串表示形式。

source: Returns a string representation of the first argument in the radix specified by the second argument.
zh_cn: 返回在使用第二个参数指定的基数时第一个参数的字符串表示形式。

source: Returns a string representation of the integer argument as an unsigned integer in base 16.
zh_cn: 以十六进制（基数 16）无符号整数形式返回一个整数参数的字符串表示形式。

source: Returns a string representation of the integer argument as an unsigned integer in base 2.
zh_cn: 以二进制（基数 2）无符号整数形式返回一个整数参数的字符串表示形式。

source: Returns a string representation of the integer argument as an unsigned integer in base 8.
zh_cn: 以八进制（基数 8）无符号整数形式返回一个整数参数的字符串表示形式。

source: Returns a string representation of the object.
zh_cn: 返回该对象的字符串表示。

source: Returns a string representation of this Double object.
zh_cn: 返回此 Double 对象的字符串表示形式。

source: Returns a string representation of this Float object.
zh_cn: 返回此 Float 对象的字符串表示形式。

source: Returns a string representation of this Thread group.
zh_cn: 返回此线程组的字符串表示形式。

source: Returns a string representation of this annotation.
zh_cn: 返回此 annotation 的字符串表示形式。

source: Returns a string representation of this map.
zh_cn: 返回此映射的字符串表示形式。

source: Returns a string representation of this stack trace element.
zh_cn: 返回表示该堆栈跟踪元素的字符串。

source: Returns a string representation of this thread, including the thread's name, priority, and thread group.
zh_cn: 返回该线程的字符串表示形式，包括线程名称、优先级和线程组。

source: Returns a string representing the data in this sequence.
zh_cn: 返回此序列中数据的字符串表示形式。

source: Returns a value indicating a character's general category.
zh_cn: 返回一个指示字符的常规类别的值。

source: Returns all annotations present on this element.
zh_cn: 返回此元素上存在的所有注释。

source: Returns all annotations that are directly present on this element.
zh_cn: 返回直接存在于此元素上的所有注释。

source: Returns all of the Packages defined by this class loader and its ancestors.
zh_cn: 返回此类加载器及其祖先所定义的所有 Package。

source: Returns an Integer instance representing the specified int value.
zh_cn: 返回一个表示指定的 int 值的 Integer 实例。

source: Returns an Integer object holding the value extracted from the specified String when parsed with the radix given by the second argument.
zh_cn: 返回一个 Integer 对象，该对象中保存了用第二个参数提供的基数进行解析时从指定的 String 中提取的值。

source: Returns an Integer object holding the value of the specified String.
zh_cn: 返回保存指定的 String 的值的 Integer 对象。

source: Returns an int value with at most a single one-bit, in the position of the highest-order ("leftmost") one-bit in the specified int value.
zh_cn: 返回具有至多单个 1 位的 int 值，在指定的 int 值中最高位（最左边）的 1 位的位置。

source: Returns an int value with at most a single one-bit, in the position of the lowest-order ("rightmost") one-bit in the specified int value.
zh_cn: 返回具有至多单个 1 位的 int 值，在指定的 int 值中最低位（最右边）的 1 位的位置。

source: Returns an array containing Class objects representing all the public classes and interfaces that are members of the class represented by this Class object.
zh_cn: 返回一个包含某些 Class 对象的数组，这些对象表示属于此 Class 对象所表示的类的成员的所有公共类和接口。

source: Returns an array containing Constructor objects reflecting all the public constructors of the class represented by this Class object.
zh_cn: 返回一个包含某些 Constructor 对象的数组，这些对象反映此 Class 对象所表示的类的所有公共构造方法。

source: Returns an array containing Field objects reflecting all the accessible public fields of the class or interface represented by this Class object.
zh_cn: 返回一个包含某些 Field 对象的数组，这些对象反映此 Class 对象所表示的类或接口的所有可访问公共字段。

source: Returns an array containing Method objects reflecting all the public member methods of the class or interface represented by this Class object, including those declared by the class or interface and those inherited from superclasses and superinterfaces.
zh_cn: 返回一个包含某些 Method 对象的数组，这些对象反映此 Class 对象所表示的类或接口（包括那些由该类或接口声明的以及从超类和超接口继承的那些的类或接口）的公共 member 方法。

source: Returns an array containing all of the exceptions that were suppressed, typically by the try-with-resources statement, in order to deliver this exception.
zh_cn: 返回包含所有被抑制的异常的数组，通常由 try-with-resources 语句来传递此异常。

source: Returns an array containing all the annotations of this class.
zh_cn: 返回一个包含该类别的所有注释的数组。

source: Returns an array of Class objects reflecting all the classes and interfaces declared as members of the class represented by this Class object.
zh_cn: 返回 Class 对象的一个数组，这些对象反映声明为此 Class 对象所表示的类的成员的所有类和接口。

source: Returns an array of Class objects that represent the formal parameter types, in declaration order, of the constructor represented by this Constructor object.
zh_cn: 按照声明顺序返回一组 Class 对象，这些对象表示此 Constructor 对象所表示构造方法的形参类型。

source: Returns an array of Class objects that represent the formal parameter types, in declaration order, of the method represented by this Method object.
zh_cn: 按照声明顺序返回 Class 对象的数组，这些对象描述了此 Method 对象所表示的方法的形参类型。

source: Returns an array of Class objects that represent the types of exceptions declared to be thrown by the underlying constructor represented by this Constructor object.
zh_cn: 返回一组表示声明要抛出的异常类型的 Class 对象，这些异常是由此 Constructor 对象表示的底层构造方法抛出的。

source: Returns an array of Class objects that represent the types of the exceptions declared to be thrown by the underlying method represented by this Method object.
zh_cn: 返回 Class 对象的数组，这些对象描述了声明将此 Method 对象表示的底层方法抛出的异常类型。

source: Returns an array of Constructor objects reflecting all the constructors declared by the class represented by this Class object.
zh_cn: 返回 Constructor 对象的一个数组，这些对象反映此 Class 对象表示的类声明的所有构造方法。

source: Returns an array of Field objects reflecting all the fields declared by the class or interface represented by this Class object.
zh_cn: 返回 Field 对象的一个数组，这些对象反映此 Class 对象所表示的类或接口所声明的所有字段。

source: Returns an array of Method objects reflecting all the methods declared by the class or interface represented by this Class object.
zh_cn: 返回 Method 对象的一个数组，这些对象反映此 Class 对象表示的类或接口声明的所有方法，包括公共、保护、默认（包）访问和私有方法，但不包括继承的方法。

source: Returns an array of Type objects representing the actual type arguments to this type.
zh_cn: 返回表示此类型实际类型参数的 Type 对象的数组。

source: Returns an array of Type objects representing the lower bound(s) of this type variable.
zh_cn: 返回表示此类型变量下边界的 Type 对象的数组。

source: Returns an array of Type objects representing the upper bound(s) of this type variable.
zh_cn: 返回表示此类型变量上边界的 Type 对象的数组。

source: Returns an array of Type objects that represent the exceptions declared to be thrown by this Constructor object.
zh_cn: 返回一组 Type 对象，这些对象表示声明要由此 Constructor 对象抛出的异常。

source: Returns an array of Type objects that represent the exceptions declared to be thrown by this Method object.
zh_cn: 返回 Type 对象数组，这些对象描述了声明由此 Method 对象抛出的异常。

source: Returns an array of Type objects that represent the formal parameter types, in declaration order, of the method represented by this Constructor object.
zh_cn: 按照声明顺序返回一组 Type 对象，这些对象表示此 Constructor 对象所表示的方法的形参类型。

source: Returns an array of Type objects that represent the formal parameter types, in declaration order, of the method represented by this Method object.
zh_cn: 按照声明顺序返回 Type 对象的数组，这些对象描述了此 Method 对象所表示的方法的形参类型的。

source: Returns an array of TypeVariable objects that represent the type variables declared by the generic declaration represented by this GenericDeclaration object, in declaration order.
zh_cn: 按声明顺序返回 TypeVariable 对象的一个数组，这些对象表示用此 GenericDeclaration 对象所表示的常规声明来声明的类型变量。

source: Returns an array of arrays that represent the annotations on the formal parameters, in declaration order, of the method represented by this Constructor object.
zh_cn: 按照声明顺序返回一组数组，这些数组表示通过此 Constructor 对象表示的方法的形参上的注释。

source: Returns an array of arrays that represent the annotations on the formal parameters, in declaration order, of the method represented by this Method object.
zh_cn: 返回表示按照声明顺序对此 Method 对象所表示方法的形参进行注释的那个数组的数组。

source: Returns an array of length 0 if the underlying generic declaration declares no type variables.
zh_cn: 如果底层的一般声明未声明任何类型变量，则返回一个 0 长度的数组。

source: Returns an array of stack trace elements representing the stack dump of this thread.
zh_cn: 返回一个表示该线程堆栈转储的堆栈跟踪元素数组。

source: Returns an associated list of annotations on this element, whose class is annotationClass, or an empty array if nothing was found.
zh_cn: 返回 this 元素上的相关联的注解列表，它的类是 annotationClass，如果未找到任何内容，则返回空数组。

source: Returns an enumeration of URL objects representing all the resources with the given name.
zh_cn: 返回表示所有具有给定名称的资源的 URL 对象的枚举。

source: Returns an estimate of the number of active groups in this thread group and its subgroups.
zh_cn: 返回此线程组及其子组中活动组数的估计值。

source: Returns an estimate of the number of active threads in the current thread's thread group and its subgroups.
zh_cn: 返回当前线程的 thread group 和它的子组在活动线程的数量的估计。

source: Returns an estimate of the number of active threads in this thread group and its subgroups.
zh_cn: 返回此线程组及其子组中活动线程数的估计值。

source: Returns an input stream for reading the specified resource.
zh_cn: 返回读取指定资源的输入流。

source: Returns an instance of a proxy class for the specified interfaces that dispatches method invocations to the specified invocation handler.
zh_cn: 返回一个指定接口的代理类实例，该接口可以将方法调用指派到指定的调用处理程序。

source: Returns an iterator over elements of type T.
zh_cn: 返回 T 类型元素上的迭代器。

source: Returns an unmodifiable string map view of the current system environment.
zh_cn: 返回一个不能修改的当前系统环境的字符串映射视图。

source: Returns k.compareTo(x) if x matches kc (k's screened comparable class), else 0.
zh_cn: 如果 x 匹配 kc(k 的筛选 comparable 类)，则返回 k.compareTo(x)，否则返回 0。

source: Returns root of tree containing this node.
zh_cn: 返回包含此节点的树的根。

source: Returns sqrt(x2 +y2) without intermediate overflow or underflow.
zh_cn: 返回 sqrt(x2 +y2)，没有中间溢出或下溢。

source: Returns the Class object associated with the class or interface with the given string name, using the given class loader.
zh_cn: 使用给定的类加载器，返回与带有给定字符串名的类或接口相关联的 Class 对象。

source: Returns the Class object associated with the class or interface with the given string name.
zh_cn: 返回与带有给定字符串名的类或接口相关联的 Class 对象。

source: Returns the Class object representing the class or interface that declares the field represented by this Field object.
zh_cn: 返回表示类或接口的 Class 对象，该类或接口声明由此 Field 对象表示的字段。

source: Returns the Class object representing the class or interface that declares the method represented by this Method object.
zh_cn: 返回表示声明由此 Method 对象表示的方法的类或接口的 Class 对象。

source: Returns the Class object representing the class that declares the constructor represented by this Constructor object.
zh_cn: 返回 Class 对象，该对象表示声明由此 Constructor 对象表示的构造方法的类。

source: Returns the Class representing the component type of an array.
zh_cn: 返回表示数组组件类型的 Class。

source: Returns the Class representing the superclass of the entity (class, interface, primitive type or void) represented by this Class.
zh_cn: 返回表示此 Class 所表示的实体（类、接口、基本类型或 void）的超类的 Class。

source: Returns the GenericDeclaration object representing the generic declaration declared this type variable.
zh_cn: 返回 GenericDeclaration 对象，该对象表示声明此类型变量的一般声明。

source: Returns the ProtectionDomain of this class.
zh_cn: 返回该类的 ProtectionDomain。

source: Returns the Throwable instance wrapped in this UndeclaredThrowableException, which may be null.
zh_cn: 返回此 UndeclaredThrowableException 中包装的 Throwable 实例，它可能为 null。

source: Returns the Type object representing the class or interface that declared this type.
zh_cn: 返回 Type 对象，表示声明此类型的类或接口。

source: Returns the Type representing the direct superclass of the entity (class, interface, primitive type or void) represented by this Class.
zh_cn: 返回表示此 Class 所表示的实体（类、接口、基本类型或 void）的直接超类的 Type。

source: Returns the Types representing the interfaces directly implemented by the class or interface represented by this object.
zh_cn: 返回表示某些接口的 Type，这些接口由此对象所表示的类或接口直接实现。

source: Returns the char value at the specified index.
zh_cn: 返回指定索引处的 char 值。

source: Returns the char value in this sequence at the specified index.
zh_cn: 返回此序列中指定索引处的 char 值。

source: Returns the double value corresponding to a given bit representation.
zh_cn: 返回对应于给定位表示形式的 double 值。

source: Returns the double value of this Double object.
zh_cn: 返回此 Double 对象的 double 值。

source: Returns the double value of this Float object.
zh_cn: 返回此 Float 对象的 double 值。

source: Returns the double value that is closest in value to the argument and is equal to a mathematical integer.
zh_cn: 返回最接近参数并等于某一整数的 double 值。

source: Returns the float value corresponding to a given bit representation.
zh_cn: 返回对应于给定位表示形式的 float 值。

source: Returns the float value of this Double object.
zh_cn: 返回此 Double 对象的 float 值。

source: Returns the float value of this Float object.
zh_cn: 返回此 Float 对象的 float 值。

source: Returns the int value that the specified Unicode character represents.
zh_cn: 返回指定的 Unicode 字符表示的 int 值。

source: Returns the int value that the specified character (Unicode code point) represents.
zh_cn: 返回指定字符（Unicode 代码点）表示的 int 值。

source: Returns the java.lang.Class object for a proxy class given a class loader and an array of interfaces.
zh_cn: 返回代理类的 java.lang.Class 对象，并向其提供类加载器和接口数组。

source: Returns the long value of the system property with the specified name.
zh_cn: 使用指定名称返回系统属性的 long 值。

source: Returns the Method object for the incorrectly typed element.
zh_cn: 返回类型不正确的元素的 Method 对象。

source: Returns the Class object corresponding to this enum constant's enum type.
zh_cn: 返回与此枚举常量的枚举类型相对应的 Class 对象。

source: Returns the Class object for the annotation type with the missing element.
zh_cn: 返回带有缺少元素的注释类型的 Class 对象。

source: Returns the Class object representing the class or interface that declares the member or constructor represented by this Member.
zh_cn: 返回表示声明由此 Member 表示的成员或构造方法的类或接口的 Class 对象。

source: Returns the Java language modifiers for the constructor represented by this Constructor object, as an integer.
zh_cn: 以整数形式返回此 Constructor 对象所表示构造方法的 Java 语言修饰符。

source: Returns the Java language modifiers for the field represented by this Field object, as an integer.
zh_cn: 以整数形式返回由此 Field 对象表示的字段的 Java 语言修饰符。

source: Returns the Java language modifiers for the member or constructor represented by this Member, as an integer.
zh_cn: 作为整数返回由此 Member 所表示的成员或构造方法的 Java 语言修饰符。

source: Returns the Java language modifiers for the method represented by this Method object, as an integer.
zh_cn: 以整数形式返回此 Method 对象所表示方法的 Java 语言修饰符。

source: Returns the Java language modifiers for this class or interface, encoded in an integer.
zh_cn: 返回此类或接口以整数编码的 Java 语言修饰符。

source: Returns the Unicode directionality property for the given character (Unicode code point).
zh_cn: 返回给定字符（Unicode 代码点）的 Unicode 方向属性。

source: Returns the Unicode directionality property for the given character.
zh_cn: 返回给定字符的 Unicode 方向属性。

source: Returns the Unicode name of the specified character codePoint, or null if the code point is unassigned.
zh_cn: 返回指定字符 codePoint 的 Unicode 名称或 null 如果代码点是 unassigned。

source: Returns the absolute path name of a native library.
zh_cn: 返回本机库的绝对路径名称。

source: Returns the absolute value of a double value.
zh_cn: 返回 double 值的绝对值。

source: Returns the absolute value of a float value.
zh_cn: 返回 float 值的绝对值。

source: Returns the absolute value of a long value.
zh_cn: 返回 long 值的绝对值。

source: Returns the absolute value of an int value.
zh_cn: 返回 int 值的绝对值。

source: Returns the amount of free memory in the Java Virtual Machine.
zh_cn: 返回 Java 虚拟机中的空闲内存量。

source: Returns the angle theta from the conversion of rectangular coordinates (x, y) to polar coordinates (r, theta).
zh_cn: 将矩形坐标 (x, y) 转换成极坐标 (r, theta)，返回所得角 theta。

source: Returns the annotation type of this annotation.
zh_cn: 返回此 annotation 的注释类型。

source: Returns the annotations that are directly defined on the class represented by this Class.
zh_cn: 返回已在由此 Class 所表示的类直接定义注释。

source: Returns the approximate number of threads that are actively executing tasks.
zh_cn: 返回主动执行任务的近似线程数。

source: Returns the approximate total number of tasks that have completed execution.
zh_cn: 返回已完成执行的近似任务总数。

source: Returns the approximate total number of tasks that have ever been scheduled for execution.
zh_cn: 返回曾计划执行的近似任务总数。

source: Returns the arc cosine of a value; the returned angle is in the range 0.0 through pi.
zh_cn: 返回一个值的反余弦；返回的角度范围在 0.0 到 pi 之间。

source: Returns the arc sine of a value; the returned angle is in the range -pi/2 through pi/2.
zh_cn: 返回一个值的反正弦；返回的角度范围在 -pi/2 到 pi/2 之间。

source: Returns the arc tangent of a value; the returned angle is in the range -pi/2 through pi/2.
zh_cn: 返回一个值的反正切；返回的角度范围在 -pi/2 到 pi/2 之间。

source: Returns the argument decremented by one, throwing an exception if the result overflows a long.
zh_cn: 返回参数减一，如果结果溢出 long 则抛出异常。

source: Returns the argument decremented by one, throwing an exception if the result overflows an int.
zh_cn: 返回参数减一，如果结果溢出 int 则抛出异常。

source: Returns the argument incremented by one, throwing an exception if the result overflows a long.
zh_cn: 返回参数加一，如果结果溢出 long 则抛出异常。

source: Returns the argument incremented by one, throwing an exception if the result overflows an int.
zh_cn: 返回参数加一，如果结果溢出 int 则抛出异常。

source: Returns the assertion status that would be assigned to this class if it were to be initialized at the time this method is invoked.
zh_cn: 如果要在调用此方法时将要初始化该类，则返回将分配给该类的断言状态。

source: Returns the base 10 logarithm of a double value.
zh_cn: 返回 double 值的底数为 10 的对数。

source: Returns the canonical name of the underlying class as defined by the Java Language Specification.
zh_cn: 返回 Java Language Specification 中所定义的底层类的规范化名称。

source: Returns the cause of this exception (the Throwable instance wrapped in this UndeclaredThrowableException, which may be null).
zh_cn: 返回此异常的原因（此 UndeclaredThrowableException 中包装的 Throwable 实例，可能为 null）。

source: Returns the cause of this exception (the thrown target exception, which may be null).
zh_cn: 返回此异常的原因（抛出的目标异常，可能为 null）。

source: Returns the cause of this throwable or null if the cause is nonexistent or unknown.
zh_cn: 返回此抛出对象的原因，如果原因不存在或未知，则返回 null。

source: Returns the channel inherited from the entity that created this Java virtual machine.
zh_cn: 返回从创建此 Java 虚拟机的实体中继承的信道。

source: Returns the character (Unicode code point) at the specified index.
zh_cn: 返回指定索引处的字符（Unicode 代码点）。

source: Returns the character (Unicode code point) before the specified index.
zh_cn: 返回指定索引之前的字符（Unicode 代码点）。

source: Returns the class loader for the class.
zh_cn: 返回该类的类加载器。

source: Returns the class with the given binary name if this loader has been recorded by the Java virtual machine as an initiating loader of a class with that binary name.
zh_cn: 如果 Java 虚拟机已将此加载器记录为具有给定二进制名称的某个类的启动加载器，则返回该二进制名称的类。

source: Returns the closest int to the argument, with ties rounding to positive infinity.
zh_cn: 返回最接近参数的 int，ties 舍入为正无穷大。

source: Returns the closest long to the argument, with ties rounding to positive infinity.
zh_cn: 返回最接近参数的 long，ties 舍入为正无穷大。

source: Returns the code point at the given index of the CharSequence.
zh_cn: 返回 CharSequence 的给定索引上的代码点。

source: Returns the code point at the given index of the char array, where only array elements with index less than limit can be used.
zh_cn: 返回 char 数组的给定索引上的代码点，该数组中只有那些具有小于 limit 的 index 值的数组元素可以使用。

source: Returns the code point at the given index of the char array.
zh_cn: 返回 char 数组的给定索引上的代码点。

source: Returns the code point preceding the given index of the CharSequence.
zh_cn: 返回 CharSequence 的给定索引前面的代码点。

source: Returns the code point preceding the given index of the char array, where only array elements with index greater than or equal to start can be used.
zh_cn: 返回 char 数组的给定索引前面的代码点，该数组中只有那些具有大于等于 start 的 index 值的数组元素可以使用。

source: Returns the code point preceding the given index of the char array.
zh_cn: 返回 char 数组的给定索引前面的代码点。

source: Returns the context ClassLoader for this Thread.
zh_cn: 返回该线程的上下文 ClassLoader。

source: Returns the core number of threads.
zh_cn: 返回核心线程数。

source: Returns the correctly rounded positive square root of a double value.
zh_cn: 返回正确舍入的 double 值的正平方根。

source: Returns the cube root of a double value.
zh_cn: 返回 double 值的立方根。

source: Returns the current capacity.
zh_cn: 返回当前容量。

source: Returns the current handler for unexecutable tasks.
zh_cn: 返回用于未执行任务的当前处理程序。

source: Returns the current number of threads in the pool.
zh_cn: 返回池中的当前线程数。

source: Returns the current thread's "initial value" for this thread-local variable.
zh_cn: 返回此线程局部变量的当前线程的“初始值”。

source: Returns the current time in milliseconds.
zh_cn: 返回以毫秒为单位的当前时间。

source: Returns the current value of the running Java Virtual Machine's high-resolution time source, in nanoseconds.
zh_cn: 返回正在运行的 Java 虚拟机的高分辨率时间源的当前值(以纳秒为单位)。

source: Returns the default handler invoked when a thread abruptly terminates due to an uncaught exception.
zh_cn: 返回线程由于未捕获到异常而突然终止时调用的默认处理程序。

source: Returns the default value for the annotation member represented by this Method instance.
zh_cn: 返回由此 Method 实例表示的注释成员的默认值。

source: Returns the detail message string of this throwable.
zh_cn: 返回此 throwable 的详细消息字符串。

source: Returns the difference of the arguments, throwing an exception if the result overflows a long.
zh_cn: 返回参数的差，如果结果溢出 long，则抛出异常。

source: Returns the difference of the arguments, throwing an exception if the result overflows an int.
zh_cn: 返回参数的差，如果结果溢出 int，则抛出异常。

source: Returns the elements of this enum class or null if this Class object does not represent an enum type.
zh_cn: 返回枚举类的元素，如果此 Class 对象不表示枚举类型，则返回 null。（译注：这里中文 api 本为“如果此 Class 对象不表示枚举类型，则返回枚举类的元素或 null。”）

source: Returns the enum constant of the specified enum type with the specified name.
zh_cn: 返回带指定名称的指定枚举类型的枚举常量。

source: Returns the exit value for the subprocess.
zh_cn: 返回子进程的出口值。

source: Returns the first floating-point argument with the sign of the second floating-point argument.
zh_cn: 返回带有第二个浮点参数符号的第一个浮点参数。

source: Returns the floating-point number adjacent to the first argument in the direction of the second argument.
zh_cn: 返回第一个参数和第二个参数之间与第一个参数相邻的浮点数。

source: Returns the floating-point value adjacent to d in the direction of negative infinity.
zh_cn: 返回 d 和负无穷大之间与相邻的浮点值。

source: Returns the floating-point value adjacent to d in the direction of positive infinity.
zh_cn: 返回 d 和正无穷大之间与相邻的浮点值。

source: Returns the floating-point value adjacent to f in the direction of negative infinity.
zh_cn: 返回 f 和负无穷大之间与相邻的浮点值。

source: Returns the floating-point value adjacent to f in the direction of positive infinity.
zh_cn: 返回 f 和正无穷大之间与相邻的浮点值。

source: Returns the floor modulus of the int arguments.
zh_cn: 返回的 int 参数的 floor 模量。

source: Returns the floor modulus of the long arguments.
zh_cn: 返回的 long 参数的 floor 模量。

source: Returns the fully qualified name of the class containing the execution point represented by this stack trace element.
zh_cn: 返回类的完全限定名，该类包含由该堆栈跟踪元素所表示的执行点。

source: Returns the greater of two double values as if by calling Math.max.
zh_cn: 返回两个 double 值中的较大值，就像调用 Math.max 一样。

source: Returns the greater of two double values.
zh_cn: 返回两个 double 值中较大的一个。

source: Returns the greater of two float values as if by calling Math.max.
zh_cn: 返回两个 float 值中的较大值，就像调用 Math.max 一样。

source: Returns the greater of two float values.
zh_cn: 返回两个 float 值中较大的一个。
